lpodkalicki/blog/avr/asm/include/ATxmega256A3def.inc
.equ ACB_AC0CTRL = 912		// Analog Comparator 0 Control
.equ ACB_AC1CTRL = 913		// Analog Comparator 1 Control
.equ ACB_AC0MUXCTRL = 914		// Analog Comparator 0 MUX Control
.equ ACB_AC1MUXCTRL = 915		// Analog Comparator 1 MUX Control
.equ ACB_CTRLA = 916		// Control Register A
.equ ACB_CTRLB = 917		// Control Register B
.equ ACB_WINCTRL = 918		// Window Mode Control
.equ ACB_STATUS = 919		// Status

;***************************************************************************
;** ADCA - Analog to Digital Converter A
;***************************************************************************
	
.equ ADCA_CTRLA = 512		// Control Register A
.equ ADCA_CTRLB = 513		// Control Register B
.equ ADCA_REFCTRL = 514		// Reference Control
.equ ADCA_EVCTRL = 515		// Event Control
.equ ADCA_PRESCALER = 516		// Clock Prescaler
.equ ADCA_INTFLAGS = 518		// Interrupt Flags
.equ ADCA_TEMP = 519		// Temporary register
.equ ADCA_CAL = 524		// Calibration Value
.equ ADCA_CH0RES = 528		// Channel 0 Result
.equ ADCA_CH1RES = 530		// Channel 1 Result
.equ ADCA_CH2RES = 532		// Channel 2 Result
.equ ADCA_CH3RES = 534		// Channel 3 Result
.equ ADCA_CMP = 536		// Compare Value
.equ ADCA_CH0_CTRL = 544		// Control Register
.equ ADCA_CH0_MUXCTRL = 545		// MUX Control
.equ ADCA_CH0_INTCTRL = 546		// Channel Interrupt Control
.equ ADCA_CH0_INTFLAGS = 547		// Interrupt Flags
.equ ADCA_CH0_RES = 548		// Channel Result
.equ ADCA_CH1_CTRL = 552		// Control Register
.equ ADCA_CH1_MUXCTRL = 553		// MUX Control
.equ ADCA_CH1_INTCTRL = 554		// Channel Interrupt Control
.equ ADCA_CH1_INTFLAGS = 555		// Interrupt Flags
.equ ADCA_CH1_RES = 556		// Channel Result
.equ ADCA_CH2_CTRL = 560		// Control Register
.equ ADCA_CH2_MUXCTRL = 561		// MUX Control
.equ ADCA_CH2_INTCTRL = 562		// Channel Interrupt Control
.equ ADCA_CH2_INTFLAGS = 563		// Interrupt Flags
.equ ADCA_CH2_RES = 564		// Channel Result
.equ ADCA_CH3_CTRL = 568		// Control Register
.equ ADCA_CH3_MUXCTRL = 569		// MUX Control
.equ ADCA_CH3_INTCTRL = 570		// Channel Interrupt Control
.equ ADCA_CH3_INTFLAGS = 571		// Interrupt Flags
.equ ADCA_CH3_RES = 572		// Channel Result

;***************************************************************************
;** ADCB - Analog to Digital Converter B
;***************************************************************************
	
.equ ADCB_CTRLA = 576		// Control Register A
.equ ADCB_CTRLB = 577		// Control Register B
.equ ADCB_REFCTRL = 578		// Reference Control
.equ ADCB_EVCTRL = 579		// Event Control
.equ ADCB_PRESCALER = 580		// Clock Prescaler
.equ ADCB_INTFLAGS = 582		// Interrupt Flags
.equ ADCB_TEMP = 583		// Temporary register
.equ ADCB_CAL = 588		// Calibration Value
.equ ADCB_CH0RES = 592		// Channel 0 Result
.equ ADCB_CH1RES = 594		// Channel 1 Result
.equ ADCB_CH2RES = 596		// Channel 2 Result
.equ ADCB_CH3RES = 598		// Channel 3 Result
.equ ADCB_CMP = 600		// Compare Value
.equ ADCB_CH0_CTRL = 608		// Control Register
.equ ADCB_CH0_MUXCTRL = 609		// MUX Control
.equ ADCB_CH0_INTCTRL = 610		// Channel Interrupt Control
.equ ADCB_CH0_INTFLAGS = 611		// Interrupt Flags
.equ ADCB_CH0_RES = 612		// Channel Result
.equ ADCB_CH1_CTRL = 616		// Control Register
.equ ADCB_CH1_MUXCTRL = 617		// MUX Control
.equ ADCB_CH1_INTCTRL = 618		// Channel Interrupt Control
.equ ADCB_CH1_INTFLAGS = 619		// Interrupt Flags
.equ ADCB_CH1_RES = 620		// Channel Result
.equ ADCB_CH2_CTRL = 624		// Control Register
.equ ADCB_CH2_MUXCTRL = 625		// MUX Control
.equ ADCB_CH2_INTCTRL = 626		// Channel Interrupt Control
.equ ADCB_CH2_INTFLAGS = 627		// Interrupt Flags
.equ ADCB_CH2_RES = 628		// Channel Result
.equ ADCB_CH3_CTRL = 632		// Control Register
.equ ADCB_CH3_MUXCTRL = 633		// MUX Control
.equ ADCB_CH3_INTCTRL = 634		// Channel Interrupt Control
.equ ADCB_CH3_INTFLAGS = 635		// Interrupt Flags
.equ ADCB_CH3_RES = 636		// Channel Result

;***************************************************************************
;** DACB - Digital to Analog Converter B
;***************************************************************************
	
.equ DACB_CTRLA = 800		// Control Register A
.equ DACB_CTRLB = 801		// Control Register B
.equ DACB_CTRLC = 802		// Control Register C
.equ DACB_EVCTRL = 803		// Event Input Control
.equ DACB_TIMCTRL = 804		// Timing Control
.equ DACB_STATUS = 805		// Status
.equ DACB_GAINCAL = 808		// Gain Calibration
.equ DACB_OFFSETCAL = 809		// Offset Calibration
.equ DACB_CH0DATA = 824		// Channel 0 Data
.equ DACB_CH1DATA = 826		// Channel 1 Data

;***************************************************************************
;** RTC - Real-Time Counter
;***************************************************************************
	
.equ RTC_CTRL = 1024		// Control Register
.equ RTC_STATUS = 1025		// Status Register
.equ RTC_INTCTRL = 1026		// Interrupt Control Register
.equ RTC_INTFLAGS = 1027		// Interrupt Flags
.equ RTC_TEMP = 1028		// Temporary register
.equ RTC_CNT = 1032		// Count Register
.equ RTC_PER = 1034		// Period Register
.equ RTC_COMP = 1036		// Compare Register

;***************************************************************************
;** TWIC - Two-Wire Interface C
;***************************************************************************
	
.equ TWIC_CTRL = 1152		// TWI Common Control Register
.equ TWIC_MASTER_CTRLA = 1153		// Control Register A
.equ TWIC_MASTER_CTRLB = 1154		// Control Register B
.equ TWIC_MASTER_CTRLC = 1155		// Control Register C
.equ TWIC_MASTER_STATUS = 1156		// Status Register
.equ TWIC_MASTER_BAUD = 1157		// Baurd Rate Control Register
.equ TWIC_MASTER_ADDR = 1158		// Address Register
.equ TWIC_MASTER_DATA = 1159		// Data Register
.equ TWIC_SLAVE_CTRLA = 1160		// Control Register A
.equ TWIC_SLAVE_CTRLB = 1161		// Control Register B
.equ TWIC_SLAVE_STATUS = 1162		// Status Register
.equ TWIC_SLAVE_ADDR = 1163		// Address Register
.equ TWIC_SLAVE_DATA = 1164		// Data Register
.equ TWIC_SLAVE_ADDRMASK = 1165		// Address Mask Register

;***************************************************************************
;** TWIE - Two-Wire Interface E
;***************************************************************************
	
.equ TWIE_CTRL = 1184		// TWI Common Control Register
.equ TWIE_MASTER_CTRLA = 1185		// Control Register A
.equ TWIE_MASTER_CTRLB = 1186		// Control Register B
.equ TWIE_MASTER_CTRLC = 1187		// Control Register C
.equ TWIE_MASTER_STATUS = 1188		// Status Register
.equ TWIE_MASTER_BAUD = 1189		// Baurd Rate Control Register
.equ TWIE_MASTER_ADDR = 1190		// Address Register
.equ TWIE_MASTER_DATA = 1191		// Data Register
.equ TWIE_SLAVE_CTRLA = 1192		// Control Register A
.equ TWIE_SLAVE_CTRLB = 1193		// Control Register B
.equ TWIE_SLAVE_STATUS = 1194		// Status Register
.equ TWIE_SLAVE_ADDR = 1195		// Address Register
.equ TWIE_SLAVE_DATA = 1196		// Data Register
.equ TWIE_SLAVE_ADDRMASK = 1197		// Address Mask Register

;***************************************************************************
;** PORT_CFG - Port Configuration
;***************************************************************************
	
.equ PORTCFG_MPCMASK = 176		// Multi-pin Configuration Mask
.equ PORTCFG_VPCTRLA = 178		// Virtual Port Control Register A
.equ PORTCFG_VPCTRLB = 179		// Virtual Port Control Register B
.equ PORTCFG_CLKEVOUT = 180		// Clock and Event Out Register

;***************************************************************************
;** VPORT0 - Virtual Port 0
;***************************************************************************
	
